#type: ignore
import re
_z='&#154;'
_y='&#138;'
_x='&#156;'
_w='&#140;'
_v='&oslash;'
_u='&Oslash;'
_t='&ouml;'
_s='&otilde;'
_r='&ocirc;'
_q='&oacute;'
_p='&ograve;'
_o='&Ouml;'
_n='&Otilde;'
_m='&Ocirc;'
_l='&Oacute;'
_k='&Ograve;'
_j='&ntilde;'
_i='&Ntilde;'
_h='&iuml;'
_g='&icirc;'
_f='&iacute;'
_e='&igrave;'
_d='&Iuml;'
_c='&Icirc;'
_b='&Iacute;'
_a='&Igrave;'
_Z='&#131;'
_Y='&euml;'
_X='&ecirc;'
_W='&eacute;'
_V='&egrave;'
_U='&Euml;'
_T='&Ecirc;'
_S='&Eacute;'
_R='&Egrave;'
_Q='&ccedil;'
_P='&Ccedil;'
_O='&szlig;'
_N='&aelig;'
_M='&AElig;'
_L=' &aring;'
_K='&auml;'
_J='&atilde;'
_I='&acirc;'
_H='&aacute;'
_G='&agrave;'
_F='&Aring;'
_E='&Auml;'
_D='&Atilde;'
_C='&Acirc;'
_B='&Aacute;'
_A='&Agrave;'
def decode(text):
 A=text;C=[_A,_B,_C,_D,_E,_F,_G,_H,_I,_J,_K,_L,_M,_N,_O,_P,_Q,_R,_S,_T,_U,_V,_W,_X,_Y,_Z,_a,_b,_c,_d,_e,_f,_g,_h,_i,_j,_k,_l,_m,_n,_o,_p,_q,_r,_s,_t,_u,_v,_w,_x,_y,_z,'&Ugrave;','&Uacute;','&Ucirc;','&Uuml;','&ugrave;','&uacute;','&ucirc;','&uuml;','&#181;','&#215;','&Yacute;','&#159;','&yacute;','&yuml;','&#176;','&#134;','&#135;','&lt;','&gt;','&#177;','&#171;','&#187;','&#191;','&#161;','&#183;','&#149;','&#153;','&copy;','&reg;','&#167;','&#182;'];D=['À','Á','Â','Ã','Ä','Å','à','á','â','ã','ä','å','Æ','æ','ß','Ç','ç','È','É','Ê','Ë','è','é','ê','ë','ƒ','Ì','Í','Î','Ï','ì','í','î','ï','Ñ','ñ','Ò','Ó','Ô','Õ','Ö','ò','ó','ô','õ','ö','Ø','ø','Œ','œ','Š','š','Ù','Ú','Û','Ü','ù','ú','û','ü','µ','×','Ý','Ÿ','ý','ÿ','°','†','‡','<','>','±','«','»','¿','¡','·','•','™','©','®','§','¶'];E=re.findall('&\\w+;',A)
 for B in E:
  if B in C:F=C.index(B);G=D[F];A=A.replace(B,G)
 return A
def encode(text):
 A=text;B=[_A,_B,_C,_D,_E,_F,_G,_H,_I,_J,_K,_L,_M,_N,_O,_P,_Q,_R,_S,_T,_U,_V,_W,_X,_Y,_Z,_a,_b,_c,_d,_e,_f,_g,_h,_i,_j,_k,_l,_m,_n,_o,_p,_q,_r,_s,_t,_u,_v,_w,_x,_y,_z,'&Ugrave;','&Uacute;','&Ucirc;','&Uuml;','&ugrave;','&uacute;','&ucirc;','&uuml;','&#181;','&#215;','&Yacute;','&#159;','&yacute;','&yuml;','&#176;','&#134;','&#135;','&lt;','&gt;','&#177;','&#171;','&#187;','&#191;','&#161;','&#183;','&#149;','&#153;','&copy;','&reg;','&#167;','&#182;'];C=['À','Á','Â','Ã','Ä','Å','à','á','â','ã','ä','å','Æ','æ','ß','Ç','ç','È','É','Ê','Ë','è','é','ê','ë','ƒ','Ì','Í','Î','Ï','ì','í','î','ï','Ñ','ñ','Ò','Ó','Ô','Õ','Ö','ò','ó','ô','õ','ö','Ø','ø','Œ','œ','Š','š','Ù','Ú','Û','Ü','ù','ú','û','ü','µ','×','Ý','Ÿ','ý','ÿ','°','†','‡','<','>','±','«','»','¿','¡','·','•','™','©','®','§','¶']
 for(D,E)in zip(B,C):A=A.replace(E,D)
 return A
__all__=['decode','encode']